{
  "title": "Sandalwood Face Mask Powder",
  "date": "2025-11-30",
  "price": 179,
  "excerpt": "Cooling sandalwood mask powder blended with neem and Fuller’s earth for Pitta and blemish-prone skin.",
  "images": [
    "/og-image.png"
  ],
  "category": "Skin Care",
  "sku": "MASK-SAND-001",
  "tags": [
    "sandalwood",
    "face mask",
    "pitta care",
    "multani mitti",
    "neem"
  ],
  "content": "## What Is Sandalwood Face Mask Powder?\nA cooling, Ayurvedic face mask powder formulated from pure sandalwood, neem powder, and multani mitti (Fuller’s earth). Designed to soothe heated, irritated, or blemish-prone skin while gently brightening and calming inflammation.\n\n## Ayurvedic Significance\nSandalwood (Chandana) is cooling and sattvic—excellent for pacifying Pitta and calming redness. Neem adds antibacterial and detoxifying action, while multani mitti draws out excess oil and impurities.\n\n### Key Benefits\n- Cooling and anti-inflammatory for Pitta-prone skin.\n- Helps reduce irritation and redness.\n- Brightens dull skin and absorbs excess sebum.\n- Gentle spot-care for occasional blemishes.\n\n## Ingredients\n- **Sandalwood powder**\n- **Neem powder**\n- **Multani mitti (Fuller’s earth)**\n\n## Usage Instructions\n- Mix 1–2 tsp powder with rose water (or plain water) to form a smooth paste.\n- Apply evenly to the face, leave for **10–15 minutes**, then rinse with cool water.\n- Use **1–2 times weekly** or as needed for cooling and clarity.\n\n## Packaging\n- Packaged in a small glass jar with a measuring spoon to ensure correct dosing and minimal contamination.\n\n## Storage\n- Keep in a cool, dry place away from direct sunlight.\n- Ensure lid is closed to prevent moisture.\n\n## Safety & Consultation\n- Patch test before first use. Avoid on broken skin.\n- Consult a dermatologist or practitioner if you have severe acne, eczema, or sensitive reactions.\n\n## Why Choose This Mask?\nA simple, effective traditional recipe in a modern, clean format—perfect as a weekly cooling ritual for clearer, calmer skin."
}